doc/s-sql-e.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:47 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples E</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples E</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org424e48e">S-SQL Examples Home Page</a></li>
<li><a href="#enum">Enum</a></li>
<li><a href="#except">Except</a></li>
<li><a href="#exists">Exists</a></li>
<li><a href="#extract">Extract</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org424e48e" class="outline-2">
<h2 id="org424e48e"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org424e48e">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-enum" class="outline-2">
<h2 id="enum">Enum</h2>
<div class="outline-text-2" id="text-enum">
<p>
Per the postgresql documentation, Enumerated (enum) types are data types that comprise a static, ordered set of values. They are equivalent to the enum types supported in a number of programming languages. An example of an enum type might be the days of the week, or a set of status values for a piece of data. In this example, we are going to create an enumerated type "rainbow" with specific allowed colors.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:create-enum</span> 'rainbow
                     (list <span class="org-string">"red"</span> <span class="org-string">"orange"</span> <span class="org-string">"yellow"</span> <span class="org-string">"green"</span> <span class="org-string">"blue"</span> <span class="org-string">"purple"</span>)))

(query (<span class="org-builtin">:create-table</span> test26
                      ((name <span class="org-builtin">:type</span> text)
                       (color <span class="org-builtin">:type</span> rainbow))))

(query (<span class="org-builtin">:insert-into</span> 'test26 <span class="org-builtin">:set</span> 'name <span class="org-string">"Moe"</span> 'current-color <span class="org-string">"yellow"</span>))
</pre>
</div>

<p>
Now if we try to insert an invalid type, we will trigger an error:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'test26 <span class="org-builtin">:set</span> 'name <span class="org-string">"Moe"</span> 'current-color <span class="org-string">"chartreuse"</span>))

Database error 22P02: invalid input value for enum rainbow: <span class="org-string">"chartreuse"</span> Query: insert into test26 values ('Moe', 'chartreuse')

[Condition of type CL-POSTGRES-ERROR:DATA-EXCEPTION]
</pre>
</div>
</div>
</div>

<div id="outline-container-except" class="outline-2">
<h2 id="except">Except</h2>
<div class="outline-text-2" id="text-except">
<p>
The sql except operator returns rows that are in the first selection but not in the second selection. Following on with our like example, assume we want all countries with "New" in their name, but not countries with "Zealand" in their names.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:except</span> (<span class="org-builtin">:select</span> 'id 'name
                         <span class="org-builtin">:from</span> 'countries
                         <span class="org-builtin">:where</span> (<span class="org-builtin">:like</span> 'name <span class="org-string">"%New%"</span>))
                (<span class="org-builtin">:select</span> 'id 'name
                         <span class="org-builtin">:from</span> 'countries
                         <span class="org-builtin">:where</span> (<span class="org-builtin">:like</span> 'name <span class="org-string">"%Zealand%"</span>))))

((108 <span class="org-string">"Papua New Guinea"</span>) (103 <span class="org-string">"New Caledonia"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-exists" class="outline-2">
<h2 id="exists">Exists</h2>
<div class="outline-text-2" id="text-exists">
<p>
Exists is used to run one subquery when a second subquery returns at least one row. For example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> 'id 'name
                <span class="org-builtin">:from</span> 'regions
                <span class="org-builtin">:where</span> (<span class="org-builtin">:exists</span>
                        (<span class="org-builtin">:select</span> 'region-id
                                 <span class="org-builtin">:from</span> 'countries
                                 <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span>
                                         (<span class="org-builtin">:=</span> 'countries.name <span class="org-string">"Costa Rica"</span>)
                                         (<span class="org-builtin">:=</span> 'regions.id 'countries.region-id))))))

((3 <span class="org-string">"Central America"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-extract" class="outline-2">
<h2 id="extract">Extract</h2>
<div class="outline-text-2" id="text-extract">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:order-by</span> (<span class="org-builtin">:select</span> 'facid
                         (<span class="org-builtin">:as</span> (<span class="org-builtin">:extract</span> 'month 'starttime) 'month)
                         (<span class="org-builtin">:as</span> (<span class="org-builtin">:sum</span> 'slots) 'total-slots)
                         <span class="org-builtin">:from</span> 'cd.bookings
                         <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:&gt;=</span> 'starttime <span class="org-string">"2012-01-01"</span>)
                                      (<span class="org-builtin">:&lt;</span> 'starttime <span class="org-string">"2013-01-01"</span>))
                         <span class="org-builtin">:group-by</span> 'facid 'month)
                'facid 'month))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>